IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM30_CONTROLSS_G3_EPWM30.xml
	<register id="CONTROLSS_G3_EPWM30_TZOSTCLR" acronym="CONTROLSS_G3_EPWM30_TZOSTCLR" offset="0x132" width="16" description="Trip Zone OST Clear Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Clear Flag for CAPEVT selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[CAPEVT] bit." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 1 selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[DCBEVT1] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 1 selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[DCAEVT1] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="OST6" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Oneshot [OST6] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST6] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="OST5" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Oneshot [OST5] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST5] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="OST4" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Oneshot [OST4] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST4] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST3" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for Oneshot [OST3] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST3] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="OST2" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Oneshot [OST2] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST2] bit." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="OST1" width="1" begin="0" end="0" resetval="0x0" description="Clear Flag for Oneshot [OST1] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST1] bit." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_TZFRC" acronym="CONTROLSS_G3_EPWM30_TZFRC" offset="0x136" width="16" description="Trip Zone Force Register">
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Force Flag for Capture Event Output   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the CAPEVT event trip condition and sets the TZFLG[CAPEVT] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Force Flag for Digital Compare Output B Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT2 event trip condition and sets the TZFLG[DCBEVT2] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Force Flag for Digital Compare Output B Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT1 event trip condition and sets the TZFLG[DCBEVT1] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Force Flag for Digital Compare Output A Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCAEVT2 event trip condition and sets the TZFLG[DCAEVT2] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Force Flag for Digital Compare Output A Event 1   0: Writing 0 has no effect. This bit always reads back 0  1: Writing 1 forces the DCAEVT1 event trip condition and sets the TZFLG[DCAEVT1] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Force a One-Shot Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a one-shot trip event and sets the TZFLG[OST] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Force a Cycle-by-Cycle Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a cycle-by-cycle trip event and sets the TZFLG[CBC] bit." range="1" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_TZTRIPOUTSEL" acronym="CONTROLSS_G3_EPWM30_TZTRIPOUTSEL" offset="0x13A" width="16" description="Trip Zone Force Register">
		<bitfield id="CAPEVT" width="1" begin="12" end="12" resetval="0x0" description="CAPEVT Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="12" rwaccess="R/W"/> 
		<bitfield id="DCBEVT2" width="1" begin="11" end="11" resetval="0x0" description="DCBEVT2 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="11" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="1" begin="10" end="10" resetval="0x0" description="DCBEVT1 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="10" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="1" begin="9" end="9" resetval="0x0" description="DCAEVT2 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="9" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="1" begin="8" end="8" resetval="0x0" description="DCAEVT1 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="8" rwaccess="R/W"/> 
		<bitfield id="TZ6" width="1" begin="7" end="7" resetval="0x0" description="Trip-zone 6 [TZ6] Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="7" rwaccess="R/W"/> 
		<bitfield id="TZ5" width="1" begin="6" end="6" resetval="0x0" description="Trip-zone 5 [TZ5] Select   0: Disable TZ5 as a TRIPOUT source for this ePWM module  1: Enable TZ5 as a TRIPOUT source for this ePWM module" range="6" rwaccess="R/W"/> 
		<bitfield id="TZ4" width="1" begin="5" end="5" resetval="0x0" description="Trip-zone 4 [TZ4] Select   0: Disable TZ4 as a TRIPOUT source for this ePWM module  1: Enable TZ4 as a TRIPOUT source for this ePWM module" range="5" rwaccess="R/W"/> 
		<bitfield id="TZ3" width="1" begin="4" end="4" resetval="0x0" description="Trip-zone 3 [TZ3] Select   0: Disable TZ3 as a TRIPOUT source for this ePWM module  1: Enable TZ3 as a TRIPOUT source for this ePWM module" range="4" rwaccess="R/W"/> 
		<bitfield id="TZ2" width="1" begin="3" end="3" resetval="0x0" description="Trip-zone 2 [TZ2] Select   0: Disable TZ2 as a TRIPOUT source for this ePWM module  1: Enable TZ2 as a TRIPOUT source for this ePWM module" range="3" rwaccess="R/W"/> 
		<bitfield id="TZ1" width="1" begin="2" end="2" resetval="0x0" description="Trip-zone 1 [TZ1] Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="CBC  Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="1" rwaccess="R/W"/> 
		<bitfield id="OST" width="1" begin="0" end="0" resetval="0x0" description="OST Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETSEL" acronym="CONTROLSS_G3_EPWM30_ETSEL" offset="0x148" width="16" description="Event Trigger Selection Register">
		<bitfield id="SOCBEN" width="1" begin="15" end="15" resetval="0x0" description="Enable the ADC Start of Conversion B [EPWMxSOCB] Pulse   0: Disable EPWMxSOCB.  1: Enable EPWMxSOCB pulse." range="15" rwaccess="R/W"/> 
		<bitfield id="SOCBSEL" width="3" begin="14" end="12" resetval="0x0" description="EPWMxSOCB Selection Options  These bits determine when a EPWMxSOCB pulse will be generated.   000: Enable DCBEVT1.soc event  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETSOCBMIX].  ETSOCBMIX is configured in the ETSOCBMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by SOCBSELCMP bit." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="SOCAEN" width="1" begin="11" end="11" resetval="0x0" description="Enable the ADC Start of Conversion A [EPWMxSOCA] Pulse   0: Disable EPWMxSOCA.  1: Enable EPWMxSOCA pulse." range="11" rwaccess="R/W"/> 
		<bitfield id="SOCASEL" width="3" begin="10" end="8" resetval="0x0" description="EPWMxSOCA Selection Options  These bits determine when a EPWMxSOCA pulse will be generated.   000: Enable DCAEVT1.soc event  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETSOCAMIX].  ETSOCAMIX is configured in the ETSOCAMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by SOCASELCMP bit." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="INTSELCMP" width="1" begin="6" end="6" resetval="0x0" description="EPWMxINT Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to INTSEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to INTSEL selection mux." range="6" rwaccess="R/W"/> 
		<bitfield id="SOCBSELCMP" width="1" begin="5" end="5" resetval="0x0" description="EPWMxSOCB Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to SOCBSEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to SOCBSEL selection mux." range="5" rwaccess="R/W"/> 
		<bitfield id="SOCASELCMP" width="1" begin="4" end="4" resetval="0x0" description="EPWMxSOCA Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to SOCASEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to SOCASEL selection mux." range="4" rwaccess="R/W"/> 
		<bitfield id="INTEN" width="1" begin="3" end="3" resetval="0x0" description="Enable ePWM Interrupt [EPWMx_INT] Generation   0: Disable EPWMx_INT generation  1: Enable EPWMx_INT generation" range="3" rwaccess="R/W"/> 
		<bitfield id="INTSEL" width="3" begin="2" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Selection Options   000: Reserved  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETINTMIX].  ETINTMIX is configured in the ETINTMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by INTSELCMP bit." range="2 - 0" rwaccess="R/W"/>
	</register>
