IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM30_CONTROLSS_G3_EPWM30.xml
	<register id="CONTROLSS_G3_EPWM30_ETPS" acronym="CONTROLSS_G3_EPWM30_ETPS" offset="0x14C" width="16" description="Event Trigger Pre-Scale Register">
		<bitfield id="SOCBCNT" width="2" begin="15" end="14" resetval="0x0" description="ePWM ADC Start-of-Conversion B Event [EPWMxSOCB] Counter Register  These bits indicate how many selected ETSEL[SOCBSEL] events have occurred:   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="15 - 14" rwaccess="R"/> 
		<bitfield id="SOCBPRD" width="2" begin="13" end="12" resetval="0x0" description="ePWM ADC Start-of-Conversion B Event [EPWMxSOCB] Period Select  These bits determine how many selected ETSEL[SOCBSEL] events need to occur before an EPWMxSOCB pulse is generated. To be generated, the pulse must be enabled [ETSEL[SOCBEN] = 1]. The SOCB pulse will be generated even if the status flag is set from a previous start of conversion [ETFLG[SOCB] = 1]. Once the SOCB pulse is generated, the ETPS[SOCBCNT] bits will automatically be cleared.   00: Disable the SOCB event counter. No EPWMxSOCB pulse will be generated  01: Generate the EPWMxSOCB pulse on the first event: ETPS[SOCBCNT] = 0,1  10: Generate the EPWMxSOCB pulse on the second event: ETPS[SOCBCNT] = 1,0  11: Generate the EPWMxSOCB pulse on the third event: ETPS[SOCBCNT] = 1,1" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="SOCACNT" width="2" begin="11" end="10" resetval="0x0" description="ePWM ADC Start-of-Conversion A Event [EPWMxSOCA] Counter Register  These bits indicate how many selected ETSEL[SOCASEL] events have occurred:   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="11 - 10" rwaccess="R"/> 
		<bitfield id="SOCAPRD" width="2" begin="9" end="8" resetval="0x0" description="ePWM ADC Start-of-Conversion A Event [EPWMxSOCA] Period Select  These bits determine how many selected ETSEL[SOCASEL] events need to occur before an EPWMxSOCA pulse is generated. To be generated, the pulse must be enabled [ETSEL[SOCAEN] = 1]. The SOCA pulse will be generated even if the status flag is set from a previous start of conversion [ETFLG[SOCA] = 1]. Once the SOCA pulse is generated, the ETPS[SOCACNT] bits will automatically be cleared.   00: Disable the SOCA event counter. No EPWMxSOCA pulse will be generated  01: Generate the EPWMxSOCA pulse on the first event: ETPS[SOCACNT] = 0,1  10: Generate the EPWMxSOCA pulse on the second event: ETPS[SOCACNT] = 1,0  11: Generate the EPWMxSOCA pulse on the third event: ETPS[SOCACNT] = 1,1" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCPSSEL" width="1" begin="5" end="5" resetval="0x0" description="EPWMxSOC A/B Pre-Scale Selection Bits   0: Selects ETPS [SOCACNT/SOCBCNT] and [SOCAPRD/SOCBPRD] registers to determine frequency of events [interrupt once every 0-3 events].  1: Selects ETSOCPS [SOCACNT2/SOCBCNT2] and [SOCAPRD2/SOCBPRD2] registers to determine frequency of events [interrupt once every 0-15 events]." range="5" rwaccess="R/W"/> 
		<bitfield id="INTPSSEL" width="1" begin="4" end="4" resetval="0x0" description="EPWMxINTn Pre-Scale Selection Bits   0: Selects ETPS [INTCNT, and INTPRD] registers to determine frequency of events [interrupt once every 0-3 events].  1: Selects ETINTPS [ INTCNT2, and INTPRD2 ] registers to determine frequency of events [interrupt once every 0-15 events]." range="4" rwaccess="R/W"/> 
		<bitfield id="INTCNT" width="2" begin="3" end="2" resetval="0x0" description="ePWM Interrupt Event [EPWMx_INT] Counter Register  These bits indicate how many selected ETSEL[INTSEL] events have occurred. These bits are automatically cleared when an interrupt pulse is generated. If interrupts are disabled, ETSEL[INT] = 0 or the interrupt flag is set, ETFLG[INT] = 1, the counter will stop counting events when it reaches the period value ETPS[INTCNT] = ETPS[INTPRD].   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="3 - 2" rwaccess="R"/> 
		<bitfield id="INTPRD" width="2" begin="1" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Period Select  These bits determine how many selected ETSEL[INTSEL] events need to occur before an interrupt is generated. To be generated, the interrupt must be enabled [ETSEL[INT] = 1]. If the interrupt status flag is set from a previous interrupt [ETFLG[INT] = 1] then no interrupt will be generated until the flag is cleared via the ETCLR[INT] bit. This allows for one interrupt to be pending while another is still being serviced. Once the interrupt is generated, the ETPS[INTCNT] bits will automatically be cleared.  Writing a INTPRD value that is the same as the current counter value will trigger an interrupt if it is enabled and the status flag is clear.  Writing a INTPRD value that is less than the current counter value will result in an undefined state. If a counter event occurs at the same instant as a new zero or non-zero INTPRD value is written, the counter is incremented.   00: Disable the interrupt event counter. No interrupt will be generated and ETFRC[INT] is ignored.  01: Generate an interrupt on the first event INTCNT = 01 [first event]  10: Generate interrupt on ETPS[INTCNT] = 1,0 [second event]  11: Generate interrupt on ETPS[INTCNT] = 1,1 [third event]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETFLG" acronym="CONTROLSS_G3_EPWM30_ETFLG" offset="0x150" width="16" description="Event Trigger Flag Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCB] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCB output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCB. The EPWMxSOCB output will continue to be generated even if the flag bit is set." range="3" rwaccess="R"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCA] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCA output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCA. The EPWMxSOCA output will continue to be generated even if the flag bit is set." range="2" rwaccess="R"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Latched ePWM Interrupt [EPWMx_INT] Status Flag   0: Indicates no event occurred  1: Indicates that an ePWMx interrupt [EPWMx_INT] was generated. No further interrupts will be generated until the flag bit is cleared. Up to one interrupt can be pending while the ETFLG[INT] bit is still set. If an interrupt is pending, it will not be generated until after the ETFLG[INT] bit is cleared." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETCLR" acronym="CONTROLSS_G3_EPWM30_ETCLR" offset="0x154" width="16" description="Event Trigger Clear Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCB] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCB] flag bit" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCA] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCA] flag bit" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[INT] flag bit and enable further interrupts pulses to be generated" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETFRC" acronym="CONTROLSS_G3_EPWM30_ETFRC" offset="0x158" width="16" description="Event Trigger Force Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="SOCB Force Bit  The SOCB pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCB] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCB and set the SOCBFLG bit. This bit is used for test purposes." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="SOCA Force Bit  The SOCA pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCA] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCA and set the SOCAFLG bit. This bit is used for test purposes." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="INT Force Bit  The interrupt will only be generated if the event is enabled in the ETSEL register. The INT flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates an interrupt on EPWMxINT and set the INT flag bit. This bit is used for test purposes." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETINTPS" acronym="CONTROLSS_G3_EPWM30_ETINTPS" offset="0x15C" width="16" description="Event-Trigger Interrupt Pre-Scale Register">
		<bitfield id="INTCNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxINT Counter 2  When ETPS[INTPSSEL]=1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="INTPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Period 2 Select  When ETPS[INTPSSEL] = 1, these bits select how many selected events need to occur before an interrupt is generated:   0000: Disable counter  0001: Generate interrupt on INTCNT = 1 [first event]  0010: Generate interrupt on INTCNT = 2 [second event]  0011: Generate interrupt on INTCNT = 3 [third event]  0100: Generate interrupt on INTCNT = 4 [fourth event]  ...  1111: Generate interrupt on INTCNT = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETSOCPS" acronym="CONTROLSS_G3_EPWM30_ETSOCPS" offset="0x160" width="16" description="Event-Trigger SOC Pre-Scale Register">
		<bitfield id="SOCBCNT2" width="4" begin="15" end="12" resetval="0x0" description="EPWMxSOCB Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="15 - 12" rwaccess="R"/> 
		<bitfield id="SOCBPRD2" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCB pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCBCNT2 = 1 [first event]  0010: Generate interrupt on SOCBCNT2 = 2 [second event]  0011: Generate interrupt on SOCBCNT2 = 3 [third event]  0100: Generate interrupt on SOCBCNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCBCNT2 = 15 [fifteenth event]" range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCACNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2  When ETPS[SOCPSSEL] = 1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="SOCAPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxSOCA Period 2 Select  When ETPS[SOCPSSEL] = 1, these bits select how many selected event need to occur before an SOCA pulse is generated:   0000: Disable counter  0001: Generate interrupt on SOCACNT2 = 1 [first event]  0010: Generate interrupt on SOCACNT2 = 2 [second event]  0011: Generate interrupt on SOCACNT2 = 3 [third event]  0100: Generate interrupt on SOCACNT2 = 4 [fourth event]  ...  1111: Generate interrupt on SOCACNT2 = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETCNTINITCTL" acronym="CONTROLSS_G3_EPWM30_ETCNTINITCTL" offset="0x164" width="16" description="Event-Trigger Counter Initialization Control Register">
		<bitfield id="SOCBINITEN" width="1" begin="15" end="15" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCB counter with contents of ETCNTINIT[SOCBINIT] on a SYNC event or software force." range="15" rwaccess="R/W"/> 
		<bitfield id="SOCAINITEN" width="1" begin="14" end="14" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxSOCA counter with contents of ETCNTINIT[SOCAINIT] on a SYNC event or software force." range="14" rwaccess="R/W"/> 
		<bitfield id="INTINITEN" width="1" begin="13" end="13" resetval="0x0" description="EPWMxINT Counter 2 Initialization Enable   0: Has no effect.  1: Enable initialization of EPWMxINT counter 2 with contents of ETCNTINIT[INTINIT] on a SYNC event or software force." range="13" rwaccess="R/W"/> 
		<bitfield id="SOCBINITFRC" width="1" begin="12" end="12" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCB counter to be initialized with the contents of ETCNTINIT[SOCBINIT]." range="12" rwaccess="R/W1TS"/> 
		<bitfield id="SOCAINITFRC" width="1" begin="11" end="11" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxSOCA counter to be initialized with the contents of ETCNTINIT[SOCAINIT]." range="11" rwaccess="R/W1TS"/> 
		<bitfield id="INTINITFRC" width="1" begin="10" end="10" resetval="0x0" description="EPWMxINT Counter 2 Initialization Force   0: Has no effect.  1: This bit forces the ET EPWMxINT counter to be initialized with the contents of ETCNTINIT[INTINIT]." range="10" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETCNTINIT" acronym="CONTROLSS_G3_EPWM30_ETCNTINIT" offset="0x168" width="16" description="Event-Trigger Counter Initialization Register">
		<bitfield id="SOCBINIT" width="4" begin="11" end="8" resetval="0x0" description="EPWMxSOCB Counter 2 Initialization Bits  The ET EPWMxSOCB counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCAINIT" width="4" begin="7" end="4" resetval="0x0" description="EPWMxSOCA Counter 2 Initialization Bits  The ET EPWMxSOCA counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="INTINIT" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Counter 2 Initialization Bits  The ET EPWMxINT counter is initialized with the contents of this register on an ePWM SYNC event or a software force." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETINTMIXEN" acronym="CONTROLSS_G3_EPWM30_ETINTMIXEN" offset="0x16C" width="16" description="Event-Trigger Mixed INT Selection">
		<bitfield id="DCAEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCAEVT1.inter to the mixed ET interrupt trigger signal [ETINTMIX].    0: DCAEVT1.soc event is not enabled  1: Enable DCAEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET interrupt trigger signal [ETINTMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET interrupt trigger signal [ETINTMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G3_EPWM30_ETSOCAMIXEN" acronym="CONTROLSS_G3_EPWM30_ETSOCAMIXEN" offset="0x170" width="16" description="Event-Trigger Mixed SOCA Selection">
		<bitfield id="DCAEVT1" width="1" begin="10" end="10" resetval="0x0" description="Enable DCAEVT1.inter to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: DCAEVT1.soc event is not enabled  1: Enable DCAEVT1.soc event" range="10" rwaccess="R/W"/> 
		<bitfield id="CDD" width="1" begin="9" end="9" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPD down-count match enable event is not enabled  1: Enable CMPD down-count match enable event" range="9" rwaccess="R/W"/> 
		<bitfield id="CDU" width="1" begin="8" end="8" resetval="0x0" description="Enable event time-base counter equal to CMPD when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPD up-count match enable event is not enabled  1: Enable CMPD up-count match enable event" range="8" rwaccess="R/W"/> 
		<bitfield id="CCD" width="1" begin="7" end="7" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPC down-count match enable event is not enabled  1: Enable CMPC down-count match enable event" range="7" rwaccess="R/W"/> 
		<bitfield id="CCU" width="1" begin="6" end="6" resetval="0x0" description="Enable event time-base counter equal to CMPC when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPC up-count match enable event is not enabled  1: Enable CMPC up-count match enable event" range="6" rwaccess="R/W"/> 
		<bitfield id="CBD" width="1" begin="5" end="5" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPB down-count match enable event is not enabled  1: Enable CMPB down-count match enable event" range="5" rwaccess="R/W"/> 
		<bitfield id="CBU" width="1" begin="4" end="4" resetval="0x0" description="Enable event time-base counter equal to CMPB when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPB up-count match enable event is not enabled  1: Enable CMPB up-count match enable event" range="4" rwaccess="R/W"/> 
		<bitfield id="CAD" width="1" begin="3" end="3" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is decrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPA down-count match enable event is not enabled  1: Enable CMPA down-count match enable event" range="3" rwaccess="R/W"/> 
		<bitfield id="CAU" width="1" begin="2" end="2" resetval="0x0" description="Enable event time-base counter equal to CMPA when the timer is incrementing to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: CMPA up-count match enable event is not enabled  1: Enable CMPA up-count match enable event" range="2" rwaccess="R/W"/> 
		<bitfield id="PRD" width="1" begin="1" end="1" resetval="0x1" description="Enable event time-base counter equal to period  [TBCTR = TBPRD] to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: Period match event is not enabled  1: Enable period match event" range="1" rwaccess="R/W"/> 
		<bitfield id="ZRO" width="1" begin="0" end="0" resetval="0x1" description="Enable event time-base counter equal to zero [TBCTR = 0x00] to the mixed ET SOCA trigger signal [ETSOCAMIX].    0: Zero match event is not enabled  1: Enable zero match event" range="0" rwaccess="R/W"/>
	</register>
